In [72]:
#Dependencies
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
from pathlib import Path
import scipy.stats as st

In [73]:
# Store file path in a variable
data_file1 = Path("Resources\AAPL_Hdata_5yr.csv")
data_file2 = Path("Resources\CSCO_HDATA_5yr.csv")
data_file3 = Path("Resources\HistoricalData5yr_SBUX.csv")
data_file4 = Path("Resources\MSFT_HData_5yr.csv")
data_file5 = Path("Resources\TSLA_HData_5yr.csv")

<>:2: SyntaxWarning: invalid escape sequence '\A'
<>:3: SyntaxWarning: invalid escape sequence '\C'
<>:4: SyntaxWarning: invalid escape sequence '\H'
<>:5: SyntaxWarning: invalid escape sequence '\M'
<>:6: SyntaxWarning: invalid escape sequence '\T'
<>:2: SyntaxWarning: invalid escape sequence '\A'
<>:3: SyntaxWarning: invalid escape sequence '\C'
<>:4: SyntaxWarning: invalid escape sequence '\H'
<>:5: SyntaxWarning: invalid escape sequence '\M'
<>:6: SyntaxWarning: invalid escape sequence '\T'
C:\Users\Diana\AppData\Local\Temp\ipykernel_26940\3595181498.py:2: SyntaxWarning: invalid escape sequence '\A'
  data_file1 = Path("Resources\AAPL_Hdata_5yr.csv")
C:\Users\Diana\AppData\Local\Temp\ipykernel_26940\3595181498.py:3: SyntaxWarning: invalid escape sequence '\C'
  data_file2 = Path("Resources\CSCO_HDATA_5yr.csv")
C:\Users\Diana\AppData\Local\Temp\ipykernel_26940\3595181498.py:4: SyntaxWarning: invalid escape sequence '\H'
  data_file3 = Path("Resources\HistoricalData5yr_SBUX.csv")
C:\Users\Diana\AppData\Local\Temp\ipykernel_26940\3595181498.py:5: SyntaxWarning: invalid escape sequence '\M'
  data_file4 = Path("Resources\MSFT_HData_5yr.csv")
C:\Users\Diana\AppData\Local\Temp\ipykernel_26940\3595181498.py:6: SyntaxWarning: invalid escape sequence '\T'
  data_file5 = Path("Resources\TSLA_HData_5yr.csv")

In [78]:
# Import the csv as a data frame
History1= pd.read_csv(data_file1, encoding="ISO-8859-1")
History2 = pd.read_csv(data_file2, encoding="ISO-8859-1")
History3 = pd.read_csv(data_file3)
History4 = pd.read_csv(data_file4)
History5 = pd.read_csv(data_file5)

History1

      Name        Date Close/Last     Volume      Open      High       Low
0     AAPL   12/8/2023   $195.71    53406360  $194.20   $195.99   $193.67
1     AAPL   12/7/2023   $194.27    47477660  $193.63   $195.00   $193.59
2     AAPL   12/6/2023   $192.32    41089740  $194.45   $194.76   $192.11
3     AAPL   12/5/2023   $193.42    66628400  $190.21   $194.40   $190.18
4     AAPL   12/4/2023   $189.43    43389520  $189.98   $190.05   $187.45
...    ...         ...        ...        ...       ...       ...       ...
1253  AAPL  12/17/2018    $40.99   173001680   $41.36    $42.09    $40.68
1254  AAPL  12/14/2018    $41.37   162481440   $42.25    $42.27    $41.32
1255  AAPL  12/13/2018    $42.74   127016840   $42.62    $43.14    $42.39
1256  AAPL  12/12/2018    $42.28   141898720   $42.60    $42.98    $42.26
1257  AAPL  12/11/2018    $42.16   183872160   $42.92    $42.95    $41.75

[1258 rows x 7 columns]

In [75]:
# Selected only relevant columns for merge
Test1 = History1[["Name","Date","Volume","Open","High","Low"]]
Test2 = History2[["Name","Date","Volume","Open","High","Low"]]

In [82]:
# Merge the two datasets by the values in the music_snapshot dataset
History_1and2_merged_df = pd.concat([Test2, Test1], axis=0)



History_1and2_merged_df

      Name        Date     Volume     Open     High      Low
0     CSCO   12/8/2023   16039940  $48.28   $48.59   $48.21
1     CSCO   12/7/2023   20478480  $47.91   $48.36   $47.80
2     CSCO   12/6/2023   19535530  $48.07   $48.21   $47.65
3     CSCO   12/5/2023   20985040  $47.75   $47.96   $47.59
4     CSCO   12/4/2023   17812930  $48.06   $48.18   $47.78
...    ...         ...        ...      ...      ...      ...
1253  AAPL  12/17/2018  173001680  $41.36   $42.09   $40.68
1254  AAPL  12/14/2018  162481440  $42.25   $42.27   $41.32
1255  AAPL  12/13/2018  127016840  $42.62   $43.14   $42.39
1256  AAPL  12/12/2018  141898720  $42.60   $42.98   $42.26
1257  AAPL  12/11/2018  183872160  $42.92   $42.95   $41.75

[2516 rows x 6 columns]

In [92]:
# Selected only relevant columns for merge
Test2 = History3[["Name","Date","Volume","Open","High","Low"]]

In [93]:
#merging history 3 and history 4
History_3and4_merged_df = pd.concat([History4,Test2], axis=0)
History_3and4_merged_df

      Name      Date Close/Last    Volume      Open      High       Low
0     MSFT   12/8/23   $374.23   20154370  $369.20   $374.46   $368.23
1     MSFT   12/7/23   $370.95   23118860  $368.23   $371.45   $366.32
2     MSFT   12/6/23   $368.80   21182070  $373.54   $374.18   $368.03
3     MSFT   12/5/23   $372.52   23065040  $366.45   $373.08   $365.62
4     MSFT   12/4/23   $369.14   32063310  $369.10   $369.52   $362.90
...    ...       ...        ...       ...       ...       ...       ...
1253  SBUX  12/17/18        NaN  15021780   $65.00    $65.63    $64.08
1254  SBUX  12/14/18        NaN  16828880   $64.44    $65.84    $63.58
1255  SBUX  12/13/18        NaN   9977871   $66.29    $67.22    $66.13
1256  SBUX  12/12/18        NaN  11082400   $66.00    $66.93    $66.00
1257  SBUX  12/11/18        NaN  10902980   $66.22    $66.92    $65.52

[2516 rows x 7 columns]

In [94]:
merging_3_4_5 = pd.concat([History5, History_3and4_merged_df],axis=0)

merging_3_4_5

      Name      Date Close/Last     Volume      Open      High       Low
0     TSLA   12/8/23   $243.84   103126800  $240.27   $245.27   $239.27
1     TSLA   12/7/23   $242.64   107142300  $241.55   $244.08   $236.98
2     TSLA   12/6/23   $239.37   126436200  $242.92   $246.57   $239.17
3     TSLA   12/5/23   $238.72   137971100  $233.87   $246.66   $233.70
4     TSLA   12/4/23   $235.58   104099800  $235.75   $239.37   $233.29
...    ...       ...        ...        ...       ...       ...       ...
1253  SBUX  12/17/18        NaN   15021780   $65.00    $65.63    $64.08
1254  SBUX  12/14/18        NaN   16828880   $64.44    $65.84    $63.58
1255  SBUX  12/13/18        NaN    9977871   $66.29    $67.22    $66.13
1256  SBUX  12/12/18        NaN   11082400   $66.00    $66.93    $66.00
1257  SBUX  12/11/18        NaN   10902980   $66.22    $66.92    $65.52

[3774 rows x 7 columns]

In [95]:
new_merged_df = pd.concat([History_1and2_merged_df, merging_3_4_5], axis=0)

new_merged_df

      Name       Date    Volume     Open     High      Low Close/Last
0     CSCO  12/8/2023  16039940  $48.28   $48.59   $48.21         NaN
1     CSCO  12/7/2023  20478480  $47.91   $48.36   $47.80         NaN
2     CSCO  12/6/2023  19535530  $48.07   $48.21   $47.65         NaN
3     CSCO  12/5/2023  20985040  $47.75   $47.96   $47.59         NaN
4     CSCO  12/4/2023  17812930  $48.06   $48.18   $47.78         NaN
...    ...        ...       ...      ...      ...      ...        ...
1253  SBUX   12/17/18  15021780  $65.00   $65.63   $64.08         NaN
1254  SBUX   12/14/18  16828880  $64.44   $65.84   $63.58         NaN
1255  SBUX   12/13/18   9977871  $66.29   $67.22   $66.13         NaN
1256  SBUX   12/12/18  11082400  $66.00   $66.93   $66.00         NaN
1257  SBUX   12/11/18  10902980  $66.22   $66.92   $65.52         NaN

[6290 rows x 7 columns]

In [91]:
new_merged_df.to_csv('merged_data_1.csv', index=False)